DATA FRAME ASSIGNMENT

In [4]:
import numpy as np

In [6]:
import pandas as pd

Create a series of temperatures in Celsius and convert them to Farenheit using the apply() method

In [53]:
s=pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [69]:
f=s.apply(lambda x:(x*9/5)+32)
f

0     50.0
1     68.0
2     86.0
3    104.0
dtype: float64

Create a DataFrame with columns [product,price,quantity] and select all rows where the price is greater than 20

In [76]:
df=pd.DataFrame({'Product':['pen','pencil','book','eraser'],'Price':[10,5,25,30],'Quantity':[10,12,13,15]})
df

  Product  Price  Quantity
0     pen     10        10
1  pencil      5        12
2    book     25        13
3  eraser     30        15

In [88]:
df.loc[df['Price']>20]

  Product  Price  Quantity
2    book     25        13
3  eraser     30        15